{
  "name": "Igor Reis Braziel",
  "subtitles": [
    "Desarrollador Full Stack",
    "Estudiante de Informática",
    "Científico de Datos",
    "Ingeniero de Software"
  ],
  "address": "Brasil",
  "shortResume": "Desarrollo aplicaciones web modernas e intuitivas con Next.js, React, Django, Spring Boot y más. También tengo conocimientos de ciencia de datos y aprendizaje automático con Python. Soy un profesional competente que trabaja constantemente en proyectos y mejora sus habilidades.",
  "about": "Soy Igor, estudiante de Informática en la Universidad Federal de Goiás (desde 2023), apasionado por la tecnología, la resolución de problemas y el aprendizaje continuo. Me desenvuelvo en entornos colaborativos, donde el trabajo en equipo y el intercambio de ideas generan mejores resultados, y me adapto rápidamente a nuevas herramientas, desafíos y oportunidades. Con determinación, enfoque y dedicación, aspiro a convertirme en un profesional que cree soluciones significativas y contribuya positivamente a cada equipo al que me uno.",
  "graduation": {
    "undergraduateCourse": "Ciencias de la Computación",
    "university": "Universidad Federal de Goiás",
    "institute": "Instituto de Informática",
    "status": "Estudiando",
    "description": "Formación profesional en el desarrollo científico y tecnológico mediante el avance y aplicación de las tecnologías de la información",
    "mainPurposes": [
      "Desarrollar Habilidades de Resolución de Problemas",
      "Comprender los Fundamentos Teóricos de la Informática",
      "Desarrollar Habilidades de Programación y Desarrollo de Software",
      "Aprender sobre Sistemas Informáticos y Arquitectura",
      "Explorar la Inteligencia Artificial (IA) y Áreas Emergentes"
    ],
    "dates": {
      "startDate": 2023,
      "endDate": 2027
    },
    "tags": [
      "Desarrollo de Software",
      "Patrones de Diseño",
      "Sistemas Operativos",
      "Arquitectura de Computadores",
      "Inteligencia Artificial",
      "Ciencia de Datos",
      "Estructura de Datos y Algoritmos",
      "Bases de Datos"
    ]
  },
  "experiences": [
    {
      "title": "Practicante de IA y Ingeniería de Datos",
      "company": "Tribunal de Contas do Estado de Goiás (TCE-GO)",
      "date": "Octubre de 2025 - Presente",
      "activities": [
        "Apoyar el desarrollo de modelos de machine learning (preprocesamiento de datos, ingeniería de características, entrenamiento de modelos)",
        "Asistir en la construcción y mantenimiento de pipelines de datos utilizando Python, SQL y herramientas ETL",
        "Ayudar en la recolección, limpieza y organización de conjuntos de datos provenientes de múltiples fuentes",
        "Colaborar en el análisis exploratorio de datos y en la creación de visualizaciones e insights",
        "Desarrollar scripts para automatizar tareas repetitivas de procesamiento de datos",
        "Probar y validar modelos de IA, documentando resultados y métricas de rendimiento",
        "Apoyar el despliegue de modelos en entornos de producción o APIs",
        "Asistir en el mantenimiento de bases de datos, data warehouses o sistemas de almacenamiento en la nube",
        "Preparar notebooks, informes y dashboards para presentar hallazgos y avances",
        "Experimentar con LLMs, embeddings, bases de datos vectoriales y técnicas de prompt engineering bajo supervisión"
      ]
    },
    {
      "title": "Instructor de Robótica y Programación",
      "company": "PLAY ROBOTICA E GAMES EDUCACIONAL LTDA",
      "date": "Septiembre de 2025 - Octubre de 2025",
      "activities": [
        "Supervisar a los estudiantes en actividades prácticas (ensamblaje de robots, desarrollo de juegos, proyectos de programación)",
        "Preparar y organizar materiales didácticos (kits de robótica, computadoras, software)",
        "Apoyar la implementación de evaluaciones y actividades lúdicas de aprendizaje en el área de tecnología",
        "Apoyar la organización de concursos o exhibiciones de proyectos estudiantiles",
        "Instalar y configurar el software educativo utilizado en clases",
        "Apoyar el mantenimiento básico de computadoras y kits de robótica",
        "Apoyar la actualización de sistemas o plataformas didácticas",
        "Probar juegos, aplicaciones y recursos digitales para su uso en el aula"
      ]
    }
  ]
}
