{
  "name": "Igor Reis Braziel",
  "subtitles": [
    "Full Stack Developer",
    "Computer Science Student",
    "Data Scientist",
    "Software Engineer"
  ],
  "address": "Brazil",
  "shortResume": "I build modern and intuitive web applications using Next.js, React, Django, Spring Boot and more. I also have knowledge in Data Science and Machine Learning using Python. I'm a competent professional who is always working on projects and improving my skills.",
  "about": "I’m Igor, a Computer Science student at the Federal University of Goiás (since 2023) with a passion for technology, problem-solving, and continuous learning. I thrive in collaborative environments, where teamwork and shared ideas lead to stronger results, and I adapt quickly to new tools, challenges, and opportunities. With determination, focus, and dedication, I aim to grow into a professional who builds meaningful solutions and contributes positively to every team I join.",
  "graduation": {
    "undergraduateCourse": "Computer Science",
    "university": "Federal University of Goiás",
    "institute": "Institute of Informatics",
    "status": "Studying",
    "description": "Professional training in scientific and technological development through advancement and application of the computing",
    "mainPurposes": [
      "Develop Problem-Solving Skills",
      "Understand Computing Theoretical Foundations",
      "Develop Programming and Software Development Skills",
      "Learn About Computer Systems and Architecture",
      "Explore Artificial Intelligence (AI) and Emerging Areas"
    ],
    "dates": {
      "startDate": 2023,
      "endDate": 2027
    },
    "tags": [
      "Software Development",
      "Design Patterns",
      "Operating Systems",
      "Computer Architecture",
      "Artificial Intelligence",
      "Data Science",
      "Data Structure and Algorithms",
      "Databases"
    ]
  },
  "experiences": [
    {
      "title": "AI & Data Engineering Intern",
      "company": "Tribunal de Contas do Estado de Goiás (TCE-GO)",
      "date": "October 2025 - Present",
      "activities": [
        "Support the development of machine learning models (data preprocessing, feature engineering, model training)",
        "Assist in building and maintaining data pipelines using Python, SQL, and ETL tools",
        "Help collect, clean, and organize datasets from multiple sources",
        "Collaborate on exploratory data analysis and creation of visual insights",
        "Develop scripts to automate repetitive data processing tasks",
        "Test and validate AI models, documenting results and performance metrics",
        "Support deployment of models into production environments or APIs",
        "Assist in maintaining databases, data warehouses, or cloud-based storage systems",
        "Prepare notebooks, reports, and dashboards to present findings and progress",
        "Experiment with LLMs, embeddings, vector databases, and prompt engineering under supervision"
      ]
    },
    {
      "title": "Programming and Robotics Instructor",
      "company": "PLAY ROBOTICA E GAMES EDUCACIONAL LTDA",
      "date": "September 2025 - October 2025",
      "activities": [
        "Supervise students in hands-on activities (robot assembly, game development, programming projects)",
        "Prepare and organize teaching materials (robotics kits, computers, software)",
        "Support the implementation of assessments and fun learning activities in the technology area",
        "Help organize competitions or exhibitions of student projects",
        "Install and configure educational software used in classes",
        "Assist with basic maintenance of computers and robotics kits",
        "Support the updating of teaching systems or platforms",
        "Test games, applications, and digital resources that will be used in class"
      ]
    }
  ]
}
