{
  "name": "Igor Reis Braziel",
  "subtitles": [
    "Desenvolvedor Full Stack",
    "Estudante de Ciência da Computação",
    "Ciêntista de Dados",
    "Engenheiro de Software"
  ],
  "address": "Brasil",
  "shortResume": "Eu construo aplicações web modernas e intuitivas usando Next.js, React, Django, Spring Boot e muito mais. Também possuo conhecimento em Ciência de Dados e Aprendizado de Máquina usando Python. Sou um profissional competente que está sempre trabalhando em projetos e aprimorando minhas habilidades.",
  "about": "Sou Igor, estudante de Ciência da Computação na Universidade Federal de Goiás (desde 2023), apaixonado por tecnologia, resolução de problemas e aprendizado contínuo. Prospero em ambientes colaborativos, onde o trabalho em equipe e o compartilhamento de ideias levam a resultados mais sólidos, e me adapto rapidamente a novas ferramentas, desafios e oportunidades. Com determinação, foco e dedicação, busco me tornar um profissional que construa soluções significativas e contribua positivamente para cada equipe da qual faço parte.",
  "graduation": {
    "undergraduateCourse": "Ciência da Computação",
    "university": "Universidade Federal de Goiás",
    "institute": "Instituto de Informática",
    "status": "Cursando",
    "description": "Formação profissional em desenvolvimento ciêntífico e tecnológico por meio do avanço e da aplicação da computação",
    "mainPurposes": [
      "Desenvolver Habilidades em Resolução de Problemas",
      "Entendimento de Fundamentos Teóricos da Computação",
      "Desenvolver Habilidades em Programação e Desenvolvimento de Software",
      "Aprender sobre Sistemas e Arquiteturas de Computadores",
      "Explorar Inteligência Artificial (IA) e Áreas Emergentes"
    ],
    "dates": {
      "startDate": 2023,
      "endDate": 2027
    },
    "tags": [
      "Desenvolvimento de Software",
      "Padrões de Projeto",
      "Sistemas Operacionais",
      "Arquitetura de Computadores",
      "Inteligência Artificial",
      "Ciência de Dados",
      "Algoritmos e Estrutura de Dados",
      "Bases de Dados"
    ]
  },
  "experiences": [
    {
      "title": "Instrutor de Robótica e Programação",
      "company": "PLAY ROBOTICA E GAMES EDUCACIONAL LTDA",
      "date": "2025 - Presente",
      "activities": [
        "Supervisionar os alunos em atividades práticas (montagem de robôs, desenvolvimento de jogos, projetos de programação)",
        "Preparar e organizar materiais didáticos (kits de robótica, computadores, softwares)",
        "Apoiar a implementação de avaliações e atividades lúdicas de aprendizagem na área de tecnologia",
        "Ajudar a organizar competições ou exposições de projetos dos alunos",
        "Instalar e configurar softwares educacionais utilizados nas aulas",
        "Auxiliar na manutenção básica de computadores e kits de robótica",
        "Apoiar a atualização de sistemas ou plataformas de ensino",
        "Testes de jogos, aplicativos e recursos digitais que serão utilizados em sala de aula"
      ]
    }
  ]
}
